# Это пример скрипта на языке программирования Python.

# Нажмите ⌃R, чтобы запустить или заменить на свой код.
# Нажмите Двойной ⇧ для поиска везде по классам, файлам, инструментам, действиям и настройкам.


def print_hi(name):
    # Используйте точку останова в строке кода ниже, чтобы отладить свой скрипт.
    print(f'Hi, {name}')  # Нажмите ⌘F8, чтобы переключить точку останова


# Нажмите на зеленую кнопку слева от текста, чтобы выполнить скрипт.
if __name__ == '__main__':
    print_hi('PyCharm')

# См. справку PyCharm на странице: https://www.jetbrains.com/help/pycharm/
